<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        PANDAS      
    </strong>
</p>

In [ ]:
import pandas as pd

dados= [
    ['Ana', 'SP', 2500.00],
    ['Marco', 'SP', 7500.50],
    ['Joana', 'RJ', 2800.00],
    ['Carlos', 'MG', 3000.56],
    ['Beatriz', 'RJ', 3200.00],
    ['Pedro', 'MG', 4000.00],
    ['Mariana', 'SP', 4500.00]
]

colunas = ['Nome', 'Estado', 'Salário']

df = pd.DataFrame(dados, columns=colunas)

df.head() # 5 primeiras linhas e 5 últimas linhas
df.shape # qtd linhas e colunas
df.info() # resumo do dataframe
df.describe() # estatísticas descritivas
df.dropna() # remover linhas com valores nulos
# strip() # remover espaços em branco precisa ser feito dentro de um loop ou usando apply
df['Nome']

In [ ]:
df.to_excel("dados_aula.xlsx", index=False)

In [ ]:
#'cod-1015'

cod = 'Codigo-1505/12255'
p = cod.index('-')+1
cod[p:]

In [ ]:
df.groupby('Estado')['Salário'].mean()

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 1 — Criando uma tabela de produtos   
    </strong>
</p>

In [88]:
import pandas as pd

produtos= [
    ['lapis','Escola', 1, 10],
    ['caneta','Escola', 1.5, 20],
    ['borracha','Escola', 0.5, 50],
    ['mochila','Escola', 22, 5],
    ['caderno','Escola', 5, 2],
    ['estojo','Escola', 3, 15],
    ['arroz','mercado', 20, 10],
    ['feijao','mercado', 10, 5],
    ['feijao','mercado', 10, 2]
    ]

colunas = ['Produto','Categoria', 'Valor', 'Qtde']

df = pd.DataFrame(produtos, columns=colunas)

df.head() # 5 primeiras linhas e 5 últimas linhas
df.shape # qtd linhas e colunas
df.info() # resumo do dataframe
df.describe() # estatísticas descritivas
df.dropna() # remover linhas com valores nulos
# strip() # remover espaços em branco precisa ser feito dentro de um loop ou usando apply
df['Produto']

df.groupby('Produto')['Qtde'].mean()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Produto    9 non-null      object
 1   Categoria  9 non-null      object
 2   Valor      9 non-null      float64
 3   Qtde       9 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 420.0+ bytes

Produto
arroz       10.0
borracha    50.0
caderno      2.0
caneta      20.0
estojo      15.0
feijao       3.5
lapis       10.0
mochila      5.0
Name: Qtde, dtype: float64

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 2 — Visualizando as primeiras linhas
    </strong>
</p>

In [89]:
print(df.head(1)) #as primeiras linhas da tabela
print(df.tail(1))  #as ultimas linhas da tabela
df.dropna()

  Produto Categoria  Valor  Qtde
0   lapis    Escola    1.0    10
  Produto Categoria  Valor  Qtde
8  feijao   mercado   10.0     2

    Produto Categoria  Valor  Qtde
0     lapis    Escola    1.0    10
1    caneta    Escola    1.5    20
2  borracha    Escola    0.5    50
3   mochila    Escola   22.0     5
4   caderno    Escola    5.0     2
5    estojo    Escola    3.0    15
6     arroz   mercado   20.0    10
7    feijao   mercado   10.0     5
8    feijao   mercado   10.0     2

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 3 — Filtrando produtos caros
    </strong>
</p>

In [103]:
df[df['Valor']>0]

df.describe()

df['Valor'].max()

df.groupby('Categoria')['Valor'].max()

df.groupby('Produto').agg(
   Valor_unit= ('Valor','max'),
   total_em_estoque= ('Qtde','sum'),
)

          Valor_unit  total_em_estoque
Produto
arroz           20.0                10
borracha         0.5                50
caderno          5.0                 2
caneta           1.5                20
estojo           3.0                15
feijao          10.0                 7
lapis            1.0                10
mochila         22.0                 5

In [100]:

# Filtrar apenas valores > 0 (se fizer sentido no seu caso)
df_pos = df[df['Valor'] > 0].copy()

# Criar a coluna Valor_total linha a linha (Valor * Qtde)
df_pos['Valor_total'] = df_pos['Valor'] * df_pos['Qtde']

# Agregar por Produto
resumo = df_pos.groupby('Produto').agg(
    Valor_unit     = ('Valor', 'max'),   # maior preço unitário do produto
    total_em_estoque   = ('Qtde',  'sum'),   # soma das quantidades
    Valor_total = ('Valor_total', 'sum')  # soma de (Valor*Qtde) das linhas
).reset_index()

resumo

    Produto  Valor_unit  total_em_estoque  Valor_total
0     arroz        20.0                10        200.0
1  borracha         0.5                50         25.0
2   caderno         5.0                 2         10.0
3    caneta         1.5                20         30.0
4    estojo         3.0                15         45.0
5    feijao        10.0                 7         70.0
6     lapis         1.0                10         10.0
7   mochila        22.0                 5        110.0

<p style="font-size: 1.1rem; color:#9beb3b; text-align: center; font-family: monospace ">
    <strong><br/><br/>
        EXERCÍCIO 4 — Resumo por categoria
    </strong>
</p>

In [101]:
df.groupby('Categoria')['Valor'].mean()

Categoria
Escola      5.500000
mercado    13.333333
Name: Valor, dtype: float64